# HasSecondProfilePoint Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RuledSurface..::..HasSecondProfilePoint Method
RuledSurface Class See Also
---
Checks if a point was used to define the second profile.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public bool HasSecondProfilePoint()
```

Visual Basic
---
```text
Public Function HasSecondProfilePoint As Boolean
```

Visual C++
---
```text
public:
bool HasSecondProfilePoint()
```

# ### Return Value
True if a point was used to define the second profile, false otherwise.
# See Also
RuledSurface Class
Autodesk.Revit.DB Namespace